content/2020-11-15-C++.org
#+title:  Some notes for C++
#+date:   <2020-11-15>
#+KEYWORDS: c++

These are some notes I wrote as I watched
[[https://www.youtube.com/playlist?list=PLlrATfBNZ98dudnM48yfGUldqGD0S4FFb][Cherno's C++ playlist]] and some other videos and resources.

* Compile and link
  :PROPERTIES:
  :CUSTOM_ID: compile-and-link
  :END:

- When compile a cpp file, all it cares is how the stuff
  (functions/class) you use in it is declared. As long as you tell it
  the declaration (e.g. function signature), it will compile. Even if it
  is never defined.
- The linking stage is actually linking all these compile stuff
  together. Therefore, if something is not defined, it will have a link
  error.

* Header and include
  :PROPERTIES:
  :CUSTOM_ID: header-and-include
  :END:

- =#include= is just copying all the stuff in the header to the current
  file. This also explains why you can do forward declaration.
- Headers has the declarations for you to compile the current file
  (translation unit).
- =#include <system_header>=
- =#include "you_own_header"=
- All the C system header ends with .h, e.g., =<stdlib.h>=
- All the C++ system header has no file extension, e.g., =<iostrem>=

* Default stuff in a class
  :PROPERTIES:
  :CUSTOM_ID: default-stuff-in-a-class
  :END:

- There are a default constructor, default destructor, default copy
  constructor/assignment operator, and default move
  constructor/assignment operator.
- default constructor/destructor is as if you have an empty body of the
  constructor/destructor. The default constructor will not initialize
  the primitive type member variable in your class.
- default copy/move ctor do something with =std::memcopy= and
  =std::memmove=. Therefore, if you have pointers in your class, the
  default copy constructor will be a shallow copy.

* When is = operator=, and when is it ctor.
  :PROPERTIES:
  :CUSTOM_ID: when-is-operator-and-when-is-it-ctor.
  :END:
#+begin_src c++
  A a;
  A b = a; // Constructor
  b = a; // operator=
#+end_src

The reasoning is pretty simple. The later one is equivalent to

#+begin_src c++
  b.operator=(a);
#+end_src

While in the former one, b has not been constructed yet, so it must be a
constructor.

* Static: lifetime and access
  :PROPERTIES:
  :CUSTOM_ID: static-lifetime-and-access
  :END:

- The static keyword inside a local scope, e.g. in a class, function
  means

  - The lifetime of this variable is the same as the entire program.
  - There is only one copy of this variable function.
  - but only code inside the scope can access it (unless you pass it
    out).
  - static functions is the same as static variables, but they feels a
    little bit different

    - forever lifetime: it can be called without an instance.
    - Only one copy: the static member function does not have a =this=
      inside it.
    - local access: you need to call it through the class.

- The static keyword outside a scope just means it is only accessible /
  linked within this file/translation unit.

* Virtual function and pure virtual function (interface)
  :PROPERTIES:
  :CUSTOM_ID: virtual-function-and-pure-virtual-function-interface
  :END:

- All method functions can be overwritten in the derived class. However,
  virtual functions will ask the compiler to create a virtual table in
  the runtime. And when you do polymorphism, it knows the correct
  function to call. Otherwise it will call the base class method if it
  is a base class pointer.
- And additional thing pure virtual functions has is that it forces the
  derived class to define it.

* Mutable
  :PROPERTIES:
  :CUSTOM_ID: mutable
  :END:
Mark a class variable mutable will allow const methods to change it.

* String literal
  :PROPERTIES:
  :CUSTOM_ID: string-literal
  :END:

- They are on a read-only memory, so you cannot modify it.
- In order to modify it, you actually ask the compiler to copy it to a
  modifiable piece of memory.

#+begin_src c++
  char * a = "hello"; // convert a const char * const to char *
  a[2] = 'c'; // Wrong. it is read only.
  char b[] = "hello"; // copied from a read only memory to stack.
  b[2] = 'c'; // It is okay.
#+end_src

