2020-11-15-C++.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Some notes for C++</title>
<meta name="generator" content="Org mode" />
<meta name="keywords" content="c++" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">Some notes for C++</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#compile-and-link">Compile and link</a></li>
<li><a href="#header-and-include">Header and include</a></li>
<li><a href="#default-stuff-in-a-class">Default stuff in a class</a></li>
<li><a href="#when-is-operator-and-when-is-it-ctor.">When is = operator=, and when is it ctor.</a></li>
<li><a href="#static-lifetime-and-access">Static: lifetime and access</a></li>
<li><a href="#virtual-function-and-pure-virtual-function-interface">Virtual function and pure virtual function (interface)</a></li>
<li><a href="#mutable">Mutable</a></li>
<li><a href="#string-literal">String literal</a></li>
<li><a href="#const">Const</a></li>
<li><a href="#stack-vs.-heap-instantiation">Stack vs. heap instantiation</a></li>
<li><a href="#implicit-conversion">Implicit conversion</a></li>
<li><a href="#stdmove">std::move</a></li>
<li><a href="#dont-return-an-rvalue-ref-just-return-a-value">Don't return an rvalue ref, just return a value</a></li>
<li><a href="#stdforward">std::forward</a></li>
<li><a href="#stdunique_ptr-stdshared_ptr-and-stdweak_ptr"><code>std::unique_ptr</code>, <code>std::shared_ptr</code>, and <code>std::weak_ptr</code></a></li>
<li><a href="#orgc3e7719">Ownership: pointer, reference, smart pointers</a></li>
<li><a href="#function-pointer">Function pointer</a></li>
<li><a href="#union-and-type-punning">Union and type punning</a></li>
<li><a href="#stdvariant">std::variant</a></li>
<li><a href="#singleton">Singleton</a></li>
<li><a href="#org57567fe">C++14 feels like a patch for C++11</a></li>
<li><a href="#org79365c7">C++17</a></li>
<li><a href="#org913d509">C++20</a>
<ul>
<li><a href="#orgff0ead1">Coroutine</a></li>
<li><a href="#orgcf27692">Concept</a></li>
<li><a href="#org078a1c9">Range</a></li>
<li><a href="#org0d4745c">Module</a></li>
</ul>
</li>
<li><a href="#orgc057208">Design Class</a>
<ul>
<li><a href="#org641f9c8">Don't make data member const or references</a></li>
<li><a href="#orgc16c6e6">Value initializer</a></li>
</ul>
</li>
<li><a href="#org699dae2">RAII: Resource Acquisition is Initialization: it means to cleanup in the destructor.</a>
<ul>
<li><a href="#orgf20af6f">This applies to raw heap pointers, file handles, mutex, etc.</a></li>
<li><a href="#org17d451a">The Rule of Three: all three need to be user defined if RAII.</a>
<ul>
<li><a href="#org209615c">destructor</a></li>
<li><a href="#org00dd904">copy ctor</a></li>
<li><a href="#orgbdddd42">copy assignment: use copy-and-swap to implement it.</a></li>
</ul>
</li>
<li><a href="#org8c794c4">Destroctor is called even after throw</a></li>
<li><a href="#orgf71c96a">The Rule of Three: if not RAII (don't store data or contains only well written Rule of Three classes)</a></li>
<li><a href="#orgce5d98c">The Rule of Five:</a>
<ul>
<li><a href="#org412c60b">all three rules plus</a></li>
<li><a href="#orgf46bf9a">move ctor</a></li>
<li><a href="#org3a10ec2">move assignment</a></li>
</ul>
</li>
<li><a href="#orgb8d90fe">The Rule of Four and a half:</a>
<ul>
<li><a href="#org5dce4dc">All three ctors</a></li>
<li><a href="#orgf961971">merge copy and move assignment into a value assignment</a></li>
<li><a href="#org280a1f5">The half is the swap function.</a></li>
</ul>
</li>
<li><a href="#orge875bb7">Good examples</a>
<ul>
<li><a href="#org0f70044"><code>unique_ptr</code>: ctor, move ctor and move assignment</a></li>
<li><a href="#org6a0e624"><code>shared_ptr</code>: all five</a></li>
<li><a href="#orgd7f0aaf"><code>unique_lock</code></a></li>
<li><a href="#orge1749ab"><code>ifstream</code></a></li>
<li><a href="#orgdabfd67"><code>lock_guard</code>: just ctor and destructor</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
These are some notes I wrote as I watched
<a href="https://www.youtube.com/playlist?list=PLlrATfBNZ98dudnM48yfGUldqGD0S4FFb">Cherno's C++ playlist</a> and some other videos and resources.
</p>

<div id="outline-container-org433a1a4" class="outline-2">
<h2 id="compile-and-link"><a id="org433a1a4"></a>Compile and link</h2>
<div class="outline-text-2" id="text-compile-and-link">
<ul class="org-ul">
<li>When compile a cpp file, all it cares is how the stuff
(functions/class) you use in it is declared. As long as you tell it
the declaration (e.g. function signature), it will compile. Even if it
is never defined.</li>
<li>The linking stage is actually linking all these compile stuff
together. Therefore, if something is not defined, it will have a link
error.</li>
</ul>
</div>
</div>

<div id="outline-container-orgdc78706" class="outline-2">
<h2 id="header-and-include"><a id="orgdc78706"></a>Header and include</h2>
<div class="outline-text-2" id="text-header-and-include">
<ul class="org-ul">
<li><code>#include</code> is just copying all the stuff in the header to the current
file. This also explains why you can do forward declaration.</li>
<li>Headers has the declarations for you to compile the current file
(translation unit).</li>
<li><code>#include &lt;system_header&gt;</code></li>
<li><code>#include "you_own_header"</code></li>
<li>All the C system header ends with .h, e.g., <code>&lt;stdlib.h&gt;</code></li>
<li>All the C++ system header has no file extension, e.g., <code>&lt;iostrem&gt;</code></li>
</ul>
</div>
</div>

<div id="outline-container-org8a2b213" class="outline-2">
<h2 id="default-stuff-in-a-class"><a id="org8a2b213"></a>Default stuff in a class</h2>
<div class="outline-text-2" id="text-default-stuff-in-a-class">
<ul class="org-ul">
<li>There are a default constructor, default destructor, default copy
constructor/assignment operator, and default move
constructor/assignment operator.</li>
<li>default constructor/destructor is as if you have an empty body of the
constructor/destructor. The default constructor will not initialize
the primitive type member variable in your class.</li>
<li>default copy/move ctor do something with <code>std::memcopy</code> and
<code>std::memmove</code>. Therefore, if you have pointers in your class, the
default copy constructor will be a shallow copy.</li>
</ul>
</div>
</div>

<div id="outline-container-org02f2d4f" class="outline-2">
<h2 id="when-is-operator-and-when-is-it-ctor."><a id="org02f2d4f"></a>When is = operator=, and when is it ctor.</h2>
<div class="outline-text-2" id="text-when-is-operator-and-when-is-it-ctor.">
<div class="org-src-container">
<pre class="src src-c++"><span style="font-weight: bold; text-decoration: underline;">A</span> <span style="font-weight: bold; font-style: italic;">a</span>;
<span style="font-weight: bold; text-decoration: underline;">A</span> <span style="font-weight: bold; font-style: italic;">b</span> = a; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Constructor</span>
b = a; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">operator=</span>
</pre>
</div>

<p>
The reasoning is pretty simple. The later one is equivalent to
</p>

<div class="org-src-container">
<pre class="src src-c++">b.<span style="font-weight: bold;">operator</span>=(a);
</pre>
</div>

<p>
While in the former one, b has not been constructed yet, so it must be a
constructor.
</p>
</div>
</div>

<div id="outline-container-orgdefae20" class="outline-2">
<h2 id="static-lifetime-and-access"><a id="orgdefae20"></a>Static: lifetime and access</h2>
<div class="outline-text-2" id="text-static-lifetime-and-access">
<ul class="org-ul">
<li>The static keyword inside a local scope, e.g. in a class, function
means

<ul class="org-ul">
<li>The lifetime of this variable is the same as the entire program.</li>
<li>There is only one copy of this variable function.</li>
<li>but only code inside the scope can access it (unless you pass it
out).</li>
<li>static functions is the same as static variables, but they feels a
little bit different

<ul class="org-ul">
<li>forever lifetime: it can be called without an instance.</li>
<li>Only one copy: the static member function does not have a <code>this</code>
inside it.</li>
<li>local access: you need to call it through the class.</li>
</ul></li>
</ul></li>

<li>The static keyword outside a scope just means it is only accessible /
linked within this file/translation unit.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc671bd0" class="outline-2">
<h2 id="virtual-function-and-pure-virtual-function-interface"><a id="orgc671bd0"></a>Virtual function and pure virtual function (interface)</h2>
<div class="outline-text-2" id="text-virtual-function-and-pure-virtual-function-interface">
<ul class="org-ul">
<li>All method functions can be overwritten in the derived class. However,
virtual functions will ask the compiler to create a virtual table in
the runtime. And when you do polymorphism, it knows the correct
function to call. Otherwise it will call the base class method if it
is a base class pointer.</li>
<li>And additional thing pure virtual functions has is that it forces the
derived class to define it.</li>
</ul>
</div>
</div>

<div id="outline-container-org31adc93" class="outline-2">
<h2 id="mutable"><a id="org31adc93"></a>Mutable</h2>
<div class="outline-text-2" id="text-mutable">
<p>
Mark a class variable mutable will allow const methods to change it.
</p>
</div>
</div>

<div id="outline-container-org7745e4f" class="outline-2">
<h2 id="string-literal"><a id="org7745e4f"></a>String literal</h2>
<div class="outline-text-2" id="text-string-literal">
<ul class="org-ul">
<li>They are on a read-only memory, so you cannot modify it.</li>
<li>In order to modify it, you actually ask the compiler to copy it to a
modifiable piece of memory.</li>
</ul>

<div class="org-src-container">
<pre class="src src-c++"><span style="font-weight: bold; text-decoration: underline;">char</span> * <span style="font-weight: bold; font-style: italic;">a</span> = <span style="font-style: italic;">"hello"</span>; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">convert a const char * const to char *</span>
a[2] = <span style="font-style: italic;">'c'</span>; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Wrong. it is read only.</span>
<span style="font-weight: bold; text-decoration: underline;">char</span> <span style="font-weight: bold; font-style: italic;">b</span>[] = <span style="font-style: italic;">"hello"</span>; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">copied from a read only memory to stack.</span>
b[2] = <span style="font-style: italic;">'c'</span>; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">It is okay.</span>
</pre>
</div>
</div>
</div>
