content/2020-11-15-C++.org
* Const
  :PROPERTIES:
  :CUSTOM_ID: const
  :END:
#+begin_src c++
  const int *a; // the integer cannot be modified.
  int const * b; // same as above.
  int * const c; // the pointer cannot be modified to point to other stuff. BTW, int& is sort of like this. Once it is initialized, it cannot be used to reference a different thing.
#+end_src

* Stack vs. heap instantiation
  :PROPERTIES:
  :CUSTOM_ID: stack-vs.-heap-instantiation
  :END:

- Stack is about 2Mb
- Two reasons to do heap instantiation:

  - pass it out of the scope
  - too big for stack

- Why is it called stack and heap memory:

  - When using stack memory, the variables are created and deleted based
    on scope. It works exactly like a stack data structure. When you
    create variables in scope, you allocate memory one after another
    just like you push things into a stack. When you go out of the
    scope, the memory allocated in the code is released one after
    another just like you pop things out of a stack.
  - Stack is a small piece of memory reserved for your program. Heap is
    a large piece of memory shared by all other programs. Therefore,
    Heap may not be all available for you to use. And the way to manage
    which part is available and how much is available is just like a
    heap data structure.

* Implicit conversion
  :PROPERTIES:
  :CUSTOM_ID: implicit-conversion
  :END:
It only does it once. For example,

#+begin_src c++
  class A
  {
      A (std::string a) {}
  };
  void print(const A& a)
  {
  };
  print("hello"); // This will not compile. "hello" is const char* const. It can be converted to std::string. However, you need to further converted to A, while is the second implicit conversion.
  print(std::string("hello")); // Good. 
#+end_src

* std::move
  :PROPERTIES:
  :CUSTOM_ID: stdmove
  :END:

- It is as simple as converting lvalue to rvalue. The real move (include
  cleaning up the source properly) happens in the move ctor or move
  assignment. std::move is just to make sure you can match to the
  function that actually do the move.
- In other words, std::move mark a value as temporary (can be stolen
  from). The move ctor or assignment actually steals it.

* Don't return an rvalue ref, just return a value
  :PROPERTIES:
  :CUSTOM_ID: dont-return-an-rvalue-ref-just-return-a-value
  :END:
#+begin_src c++
  class B
  {
      A a;
      public:
      A give() {
          return std::move(a); // what happens here is that, a is moved to a temporary var and this temporary var is returned. 
      }
  }
  int main() {
      B b;
      A a = b.give(); // with copy elision, this line does not trigger either copy or move constructor.
  }
#+end_src

#+begin_src c++
  class B
  {
      A a;
      public:
      A&& give() {
          return std::move(a); // what happens here is that, a is convert to a rvalue.
      }
  }
  int main() {
      B b;
      A a = b.give(); // move constructor is called here.
  }
#+end_src

Therefore, with copy elision, return an =A&&= does not save you
anything. However, if you return a =A&&=, potentially it can be misused.
If the receiver uses an =A&&= to receive it. This will not trigger any
real move, either. If at this moment the original copy is destroyed,
then the receiver end has a dangling pointer.

#+begin_src c++
  A&& a = b.give(); // nothing happens here as well.
#+end_src

* std::forward
  :PROPERTIES:
  :CUSTOM_ID: stdforward
  :END:
It is converting something to T&&. This is only used in a template
function used for relay purposes.

* =std::unique_ptr=, =std::shared_ptr=, and =std::weak_ptr=
  :PROPERTIES:
  :CUSTOM_ID: stdunique_ptr-stdshared_ptr-and-stdweak_ptr
  :END:

- =std::unique_ptr= has almost no overhead.
- =std::make_unique= is preferred because it handles exception
- =std::shared_ptr= is implemented as reference count.
- =std::make_shared= is preferred because it initialize control block
  and the object together.

* Ownership: pointer, reference, smart pointers
What does it mean when passing pointer, reference, smart pointers to a function (ctor).
- =A&= is almost the same as =A * const=, except that reference guarantees its existence, while pointer can be =nullptr=.
- In modern C++ and user side of the code, passing raw pointer and reference means borrow. No need to destroy.
  - There are exceptions in old-style code base, such as ceres-solver, if I remember correctly.
- Pass a =unque_ptr= is transfering ownership, while =shared_ptr= is shared ownership.

