2020-11-15-C++.html

<div id="outline-container-orga318f83" class="outline-2">
<h2 id="const"><a id="orga318f83"></a>Const</h2>
<div class="outline-text-2" id="text-const">
<div class="org-src-container">
<pre class="src src-c++"><span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">int</span> *<span style="font-weight: bold; font-style: italic;">a</span>; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">the integer cannot be modified.</span>
<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">const</span> * <span style="font-weight: bold; font-style: italic;">b</span>; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">same as above.</span>
<span style="font-weight: bold; text-decoration: underline;">int</span> * <span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">c</span>; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">the pointer cannot be modified to point to other stuff. BTW, int&amp; is sort of like this. Once it is initialized, it cannot be used to reference a different thing.</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org05ddbde" class="outline-2">
<h2 id="stack-vs.-heap-instantiation"><a id="org05ddbde"></a>Stack vs. heap instantiation</h2>
<div class="outline-text-2" id="text-stack-vs.-heap-instantiation">
<ul class="org-ul">
<li>Stack is about 2Mb</li>
<li>Two reasons to do heap instantiation:

<ul class="org-ul">
<li>pass it out of the scope</li>
<li>too big for stack</li>
</ul></li>

<li>Why is it called stack and heap memory:

<ul class="org-ul">
<li>When using stack memory, the variables are created and deleted based
on scope. It works exactly like a stack data structure. When you
create variables in scope, you allocate memory one after another
just like you push things into a stack. When you go out of the
scope, the memory allocated in the code is released one after
another just like you pop things out of a stack.</li>
<li>Stack is a small piece of memory reserved for your program. Heap is
a large piece of memory shared by all other programs. Therefore,
Heap may not be all available for you to use. And the way to manage
which part is available and how much is available is just like a
heap data structure.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org54bba5b" class="outline-2">
<h2 id="implicit-conversion"><a id="org54bba5b"></a>Implicit conversion</h2>
<div class="outline-text-2" id="text-implicit-conversion">
<p>
It only does it once. For example,
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">A</span>
{
    <span style="font-weight: bold;">A</span> (<span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">string</span> <span style="font-weight: bold; font-style: italic;">a</span>) {}
};
<span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">print</span>(<span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">A</span>&amp; <span style="font-weight: bold; font-style: italic;">a</span>)
{
};
print(<span style="font-style: italic;">"hello"</span>); <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">This will not compile. "hello" is const char* const. It can be converted to std::string. However, you need to further converted to A, while is the second implicit conversion.</span>
print(<span style="font-weight: bold; text-decoration: underline;">std</span>::string(<span style="font-style: italic;">"hello"</span>)); <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Good. </span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6909ffb" class="outline-2">
<h2 id="stdmove"><a id="org6909ffb"></a>std::move</h2>
<div class="outline-text-2" id="text-stdmove">
<ul class="org-ul">
<li>It is as simple as converting lvalue to rvalue. The real move (include
cleaning up the source properly) happens in the move ctor or move
assignment. std::move is just to make sure you can match to the
function that actually do the move.</li>
<li>In other words, std::move mark a value as temporary (can be stolen
from). The move ctor or assignment actually steals it.</li>
</ul>
</div>
</div>

<div id="outline-container-org80e4ec9" class="outline-2">
<h2 id="dont-return-an-rvalue-ref-just-return-a-value"><a id="org80e4ec9"></a>Don't return an rvalue ref, just return a value</h2>
<div class="outline-text-2" id="text-dont-return-an-rvalue-ref-just-return-a-value">
<div class="org-src-container">
<pre class="src src-c++"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">B</span>
{
    <span style="font-weight: bold; text-decoration: underline;">A</span> <span style="font-weight: bold; font-style: italic;">a</span>;
    <span style="font-weight: bold;">public</span>:
    <span style="font-weight: bold; text-decoration: underline;">A</span> <span style="font-weight: bold;">give</span>() {
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::move(a); <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">what happens here is that, a is moved to a temporary var and this temporary var is returned. </span>
    }
}
<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">main</span>() {
    <span style="font-weight: bold; text-decoration: underline;">B</span> <span style="font-weight: bold; font-style: italic;">b</span>;
    <span style="font-weight: bold; text-decoration: underline;">A</span> <span style="font-weight: bold; font-style: italic;">a</span> = b.give(); <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">with copy elision, this line does not trigger either copy or move constructor.</span>
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c++"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">B</span>
{
    <span style="font-weight: bold; text-decoration: underline;">A</span> <span style="font-weight: bold; font-style: italic;">a</span>;
    <span style="font-weight: bold;">public</span>:
    <span style="font-weight: bold; text-decoration: underline;">A</span>&amp;&amp; <span style="font-weight: bold;">give</span>() {
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::move(a); <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">what happens here is that, a is convert to a rvalue.</span>
    }
}
<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">main</span>() {
    <span style="font-weight: bold; text-decoration: underline;">B</span> <span style="font-weight: bold; font-style: italic;">b</span>;
    <span style="font-weight: bold; text-decoration: underline;">A</span> <span style="font-weight: bold; font-style: italic;">a</span> = b.give(); <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">move constructor is called here.</span>
}
</pre>
</div>

<p>
Therefore, with copy elision, return an <code>A&amp;&amp;</code> does not save you
anything. However, if you return a <code>A&amp;&amp;</code>, potentially it can be misused.
If the receiver uses an <code>A&amp;&amp;</code> to receive it. This will not trigger any
real move, either. If at this moment the original copy is destroyed,
then the receiver end has a dangling pointer.
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="font-weight: bold; text-decoration: underline;">A</span>&amp;&amp; <span style="font-weight: bold; font-style: italic;">a</span> = b.give(); <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">nothing happens here as well.</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org17a7d0a" class="outline-2">
<h2 id="stdforward"><a id="org17a7d0a"></a>std::forward</h2>
<div class="outline-text-2" id="text-stdforward">
<p>
It is converting something to T&amp;&amp;. This is only used in a template
function used for relay purposes.
</p>
</div>
</div>

<div id="outline-container-org3e062a8" class="outline-2">
<h2 id="stdunique_ptr-stdshared_ptr-and-stdweak_ptr"><a id="org3e062a8"></a><code>std::unique_ptr</code>, <code>std::shared_ptr</code>, and <code>std::weak_ptr</code></h2>
<div class="outline-text-2" id="text-stdunique_ptr-stdshared_ptr-and-stdweak_ptr">
<ul class="org-ul">
<li><code>std::unique_ptr</code> has almost no overhead.</li>
<li><code>std::make_unique</code> is preferred because it handles exception</li>
<li><code>std::shared_ptr</code> is implemented as reference count.</li>
<li><code>std::make_shared</code> is preferred because it initialize control block
and the object together.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc3e7719" class="outline-2">
<h2 id="orgc3e7719">Ownership: pointer, reference, smart pointers</h2>
<div class="outline-text-2" id="text-orgc3e7719">
<p>
What does it mean when passing pointer, reference, smart pointers to a function (ctor).
</p>
<ul class="org-ul">
<li><code>A&amp;</code> is almost the same as <code>A * const</code>, except that reference guarantees its existence, while pointer can be <code>nullptr</code>.</li>
<li>In modern C++ and user side of the code, passing raw pointer and reference means borrow. No need to destroy.
<ul class="org-ul">
<li>There are exceptions in old-style code base, such as ceres-solver, if I remember correctly.</li>
</ul></li>
<li>Pass a <code>unque_ptr</code> is transfering ownership, while <code>shared_ptr</code> is shared ownership.</li>
</ul>
</div>
</div>
