2020-11-15-C++.html

<div id="outline-container-org902af4c" class="outline-2">
<h2 id="function-pointer"><a id="org902af4c"></a>Function pointer</h2>
<div class="outline-text-2" id="text-function-pointer">
<ul class="org-ul">
<li>C style function pointer

<ul class="org-ul">
<li><code>ReturnType(*function_pointer)(ArgumentType)</code> this is the
declaration of a function pointer. <code>type variable</code> this is the
declaration of a variable</li>
<li><code>typedef ReturnType(*FunctionPointerType)(ArgumentType)</code> this is how
to typedef a function pointer type. <code>typedef Type NewTypeName</code> is
this a normal typedef.</li>
</ul></li>

<li>lambda function's type is undefined in the standard, so it is up to
the compiler's implementation. That is why you cannot pass it to a C
style function pointer. You can either use a template to hold it, or
convert it to <code>std::function</code>.</li>
</ul>
</div>
</div>

<div id="outline-container-org9ad89da" class="outline-2">
<h2 id="union-and-type-punning"><a id="org9ad89da"></a>Union and type punning</h2>
<div class="outline-text-2" id="text-union-and-type-punning">
<ul class="org-ul">
<li>type punning is to interpret a piece of memory as a different type.
For example</li>
</ul>

<div class="org-src-container">
<pre class="src src-c++"><span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">A</span>
{
    <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">x</span>, <span style="font-weight: bold; font-style: italic;">y</span>;
};
<span style="font-weight: bold; text-decoration: underline;">A</span> <span style="font-weight: bold; font-style: italic;">a</span>;
<span style="font-weight: bold; text-decoration: underline;">int</span>* <span style="font-weight: bold; font-style: italic;">b</span> = (<span style="font-weight: bold; text-decoration: underline;">int</span>*)&amp;a;
b[0]; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">a.x;</span>
b[1]; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">a.y;</span>
</pre>
</div>

<ul class="org-ul">
<li>Union is a nicer way to achieve this.</li>
</ul>
</div>
</div>

<div id="outline-container-org930c551" class="outline-2">
<h2 id="stdvariant"><a id="org930c551"></a>std::variant</h2>
<div class="outline-text-2" id="text-stdvariant">
<ul class="org-ul">
<li>a safer way to do Union</li>
<li>but instead of occupying memory that is the max of all the variants
like union, it occupies memory that is the sum of all its variants.</li>
</ul>
</div>
</div>

<div id="outline-container-org46bde8e" class="outline-2">
<h2 id="singleton"><a id="org46bde8e"></a>Singleton</h2>
<div class="outline-text-2" id="text-singleton">
<ul class="org-ul">
<li>a static member function defines and then returns a static variable
looks better than declaring a static variable and then defining this
variable.</li>
</ul>
</div>
</div>

<div id="outline-container-org57567fe" class="outline-2">
<h2 id="org57567fe"><a href="https://www.youtube.com/watch?v=mXxNvaEdNHI">C++14</a> feels like a patch for C++11</h2>
<div class="outline-text-2" id="text-org57567fe">
<ul class="org-ul">
<li><code>auto</code> as a function return type;</li>
<li>Template lambda function using auto keyword</li>
<li><p>
Generalized capture expression in lambda
</p>
<div class="org-src-container">
<pre class="src src-c++">[<span style="font-weight: bold; font-style: italic;">value</span> = v] () {}
</pre>
</div></li>
<li><code>make_unique</code>
Now, technically, you no longer to use explicit <code>new</code> and <code>delete</code>.</li>
<li>More flexible <code>constexpr</code></li>
</ul>
</div>
</div>

<div id="outline-container-org79365c7" class="outline-2">
<h2 id="org79365c7"><a href="https://www.youtube.com/watch?v=QpFjOlzg1r4">C++17</a></h2>
<div class="outline-text-2" id="text-org79365c7">
<ul class="org-ul">
<li><p>
Guaranteed Copy/ Move Elision
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="font-weight: bold;">auto</span> <span style="font-weight: bold;">factory</span>(){
  <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::make_unique&lt;<span style="font-weight: bold; text-decoration: underline;">int</span>&gt;();
  }
<span style="font-weight: bold;">main</span>() {
  <span style="font-weight: bold;">auto</span> <span style="font-weight: bold; font-style: italic;">widget</span> = factory(); <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">move will not be invoked here.</span>
  }
</pre>
</div></li>
<li>more <code>const_expr</code> in std</li>
<li><code>constexpr</code> in lambda</li>
<li><code>std::string_view</code></li>
<li><p>
Class template argument deduction
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">array</span> <span style="font-weight: bold; font-style: italic;">data</span>{1,2,3,4}; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">data will be std::array&lt;int,4&gt;</span>
</pre>
</div></li>
<li>fold expressions in variadic template</li>
<li><p>
structured bindings
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">pair</span>&lt;<span style="font-weight: bold; text-decoration: underline;">int</span>, <span style="font-weight: bold; text-decoration: underline;">double</span>&gt; <span style="font-weight: bold; font-style: italic;">v</span>{1,3.};
<span style="font-weight: bold;">auto</span> [first, second] = v;
</pre>
</div></li>
<li><p>
if-init
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="font-weight: bold;">if</span> (<span style="font-weight: bold;">auto</span> <span style="font-weight: bold; font-style: italic;">f</span> = function(); f &gt; 5){
  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">do something</span>
  }
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-org913d509" class="outline-2">
<h2 id="org913d509"><a href="https://www.youtube.com/watch?v=D81yl6_kHEM">C++20</a></h2>
<div class="outline-text-2" id="text-org913d509">
</div>
<div id="outline-container-orgff0ead1" class="outline-3">
<h3 id="orgff0ead1">Coroutine</h3>
<div class="outline-text-3" id="text-orgff0ead1">
<ul class="org-ul">
<li><code>co_yield</code> similar to python's <code>yield</code>
<b>It will be more complete in c++23. Don't do it yourself, use a library for now</b>.
The idea is that the function contains the status, and it returns different value based on the status.
Before <code>co_yield</code>, you can do it in three ways:
<ul class="org-ul">
<li>Create a class that holds the state</li>
<li>Put the state as a global variable and use it in the function. BAD STYLE!</li>
<li>Put the state in the capture of lambda. The real implementation is similar to this. It is like an object without a class definition.</li>
</ul></li>
<li><code>co_wait</code> wait for another thread to <code>co_yield</code>
Before <code>co_wait</code>, you can do it through callback:
<ul class="org-ul">
<li>When wait, register a callback to the other thread</li>
<li>When the other thread yield, call the callback</li>
<li>This is much harder to read.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgcf27692" class="outline-3">
<h3 id="orgcf27692">Concept</h3>
<div class="outline-text-3" id="text-orgcf27692">
<ul class="org-ul">
<li><p>
For template, explicitly write out the constraint of the template type.
Before C++20, template type can be anything, compile will output a "wired" error when you use the template function with a not supported type.
The way to constraint the template type is through <code>enable_if</code>, but it is pretty hard to write.
</p>

<p>
Another alternative is to use interface class and polymorphism, but this is more for unpredictable runtime types.
It is over kill and has extra price to pay if your type is known at compile-time.
</p></li>
<li>Can be combined.</li>
</ul>
</div>
</div>

<div id="outline-container-org078a1c9" class="outline-3">
<h3 id="org078a1c9">Range</h3>
<div class="outline-text-3" id="text-org078a1c9">
<ul class="org-ul">
<li>Build on top of concept</li>
<li>Lazy evaluation</li>
</ul>
</div>
</div>

<div id="outline-container-org0d4745c" class="outline-3">
<h3 id="org0d4745c">Module</h3>
<div class="outline-text-3" id="text-org0d4745c">
<ul class="org-ul">
<li>*.cppm</li>
<li>export</li>
<li>import</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgc057208" class="outline-2">
<h2 id="orgc057208"><a href="https://www.youtube.com/watch?v=O65lEiYkkbc">Design Class</a></h2>
<div class="outline-text-2" id="text-orgc057208">
</div>
<div id="outline-container-org641f9c8" class="outline-3">
<h3 id="org641f9c8">Don't make data member const or references</h3>
<div class="outline-text-3" id="text-org641f9c8">
<ul class="org-ul">
<li>Otherwise, the copy assignment and move ctor/assignment will be gone. but copy ctor is okay.</li>
<li>use a raw pointer instead of a reference. Function interface can still be a reference. It is just stored as a pointer.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc16c6e6" class="outline-3">
<h3 id="orgc16c6e6">Value initializer</h3>
<div class="outline-text-3" id="text-orgc16c6e6">
<ul class="org-ul">
<li><code>Widget w{};</code> will also initialize <code>int</code> or <code>int*</code>.</li>
<li>best practice is to put the initial value in the class when you declare the variable. The reason to not put in ctor, is to reduce duplication if you have two ctors that both need to initialize.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org699dae2" class="outline-2">
<h2 id="org699dae2"><a href="https://www.youtube.com/watch?v=7Qgd9B1KuMQ">RAII: Resource Acquisition is Initialization: it means to cleanup in the destructor.</a></h2>
<div class="outline-text-2" id="text-org699dae2">
</div>
<div id="outline-container-orgf20af6f" class="outline-3">
<h3 id="orgf20af6f">This applies to raw heap pointers, file handles, mutex, etc.</h3>
</div>
<div id="outline-container-org17d451a" class="outline-3">
<h3 id="org17d451a">The Rule of Three: all three need to be user defined if RAII.</h3>
<div class="outline-text-3" id="text-org17d451a">
</div>
